# 创建1个向量
x1 = c(71,56.5,56,61,65,62,53,53,65,71,65,57,66.5,59.1,64,69.5,64,56.5,60.2,55,57,55,57,58,59.5,61,57,57.5,70,64,74,72,62.5,68,63.4,68,69,73)
x2 = c(1629,1569,1561,1619,1566,1639,1494,1568,1610,1572,1540,1530,1622,1486,1578,1645,1648,1521,1534,1536,1547,1505,1473,1538,1513,1653,1566,1580,1630,1640,1647,1620,1637,1528,1647,1605,1625,1615)
length(x2)
mode(x2)  # 数据类型

# 将向量/矩阵合并为矩阵
rbind(x1,x2)  # 按行合并
cbind(x1,x2)  # 按列合并

# 创建矩阵
matrix(data = x1,nrow = 2, ncol = 19 )
matrix(data = x1,nrow = 2, ncol = 19, byrow = T )

# 矩阵特征
dim(A)
rowSums(A)
rowMeans(A)
colSums(A)
colMeans(A)
apply(A,2,var)  # 2代表按列计算

# 矩阵运算
A = matrix(1:12,3,4)
B = matrix(1:12,4,3)
C = matrix(1:16,4,4)
D = diag(4) + 1

t(A)
A + B
A - B
A %*% B
solve(C)
eigen(D)  # 求特征值和特征向量
chol(D)   # 斯勒茨基分解
svd(A)   # SVD分解
qr(A)   # QR分解

# 对角阵运算
diag(A)  # 提取对角阵元素
diag(c(1,2,3))   # 生成对角阵
diag(3)   # 生成3维单位阵

# 数据框
X = data.frame('身高' = x1,'体重'= x2)



